###############################################################
#  Generated by:      Cadence Innovus 16.21-s078_1
#  OS:                Linux x86_64(Host ID client04)
#  Generated on:      Wed Nov  6 22:13:27 2019
#  Design:            screen_design
#  Command:           runN2NOpt -bypassPrecheck
###############################################################
current_design screen_design
create_clock [get_ports {clk}]  -name clk -period 4.000000 -waveform {0.000000 2.000000}
set_clock_transition  -rise -min 0.1 [get_clocks {clk}]
set_clock_transition  -rise -max 0.1 [get_clocks {clk}]
set_clock_transition  -fall -min 0.1 [get_clocks {clk}]
set_clock_transition  -fall -max 0.1 [get_clocks {clk}]
set_input_delay -add_delay 3.5 -max -clock [get_clocks {clk}] [get_ports {rst}]
set_clock_uncertainty  0.01 [get_ports {clk}]
